; domain
; ==========================================================
; DOMAIN: SATELLITE
; ==========================================================
; MODELLO COMPLESSIVO:
;   - 8 direzioni con grafo (next-right/next-left) nell'init
;   - max 2 foto (slot1, slot2)
;   - max 1 foto HD (hd-in-memory)
;   - trasmissione solo da Nord (is-north nell'init)
;   - costi: rotate=1, take-picture=2, send=2
; ==========================================================

(define (domain satellite)

(:requirements
    :strips
    :typing
    :negative-preconditions
    :action-costs
)

(:types direction object)

; Funzione numerica obbligatoria con :action-costs
(:functions
    (total-cost)
)

(:predicates

    ; orientamento corrente del satellite
    (pointing ?d - direction)

    ; grafo di rotazione: dichiarato nell'init di ogni problem file
    ; (next-right ?a ?b) = ruotando a destra da ?a si arriva a ?b
    (next-right ?from - direction ?to - direction)
    (next-left  ?from - direction ?to - direction)

    ; marcatore Nord: (is-north n) nell'init evita di usare 'n'
    ; come costante hardcoded nel domain (causa "Undefined object")
    (is-north ?d - direction)

    ; visibilità: ?o è fotografabile quando il satellite punta ?d
    (visible ?o - object ?d - direction)

    ; qualità richiesta per ogni oggetto del goal
    (required-hd ?o - object)
    (required-sd ?o - object)

    ; slot di memoria fisici (max 2 foto contemporaneamente)
    (slot1-free)
    (slot2-free)

    ; flag: c'è una foto HD in memoria
    ; impedisce HD+HD (10+10=20 > max_memory=13 nei problemi hard)
    ; ma non impedisce HD+SD (10+3=13 ≤ max_memory)
    (hd-in-memory)

    ; stato delle foto per tipo (separato per gestire send correttamente)
    (stored-hd ?o - object)
    (stored-sd ?o - object)
    (sent ?o - object)
)


; ==========================================================
; ROTATE RIGHT — ruota in senso orario (costo 1)
; ==========================================================
(:action rotate-right
 :parameters (?from - direction ?to - direction)
 :precondition (and
    (pointing ?from)
    (next-right ?from ?to)
 )
 :effect (and
    (not (pointing ?from))
    (pointing ?to)
    (increase (total-cost) 1)
 )
)


; ==========================================================
; ROTATE LEFT — ruota in senso antiorario (costo 1)
; ==========================================================
(:action rotate-left
 :parameters (?from - direction ?to - direction)
 :precondition (and
    (pointing ?from)
    (next-left ?from ?to)
 )
 :effect (and
    (not (pointing ?from))
    (pointing ?to)
    (increase (total-cost) 1)
 )
)


; ==========================================================
; TAKE-PICTURE-HD — foto HD in slot 1 (costo 2)
;
; Precondizioni chiave:
;   - punta verso ?d e ?o visibile da ?d
;   - qualità richiesta è HD
;   - ?o non già in memoria né inviato (no duplicati)
;   - slot1 libero
;   - nessuna foto HD già presente (HD+HD non entra in memoria)
; ==========================================================
(:action take-picture-hd-s1
 :parameters (?o - object ?d - direction)
 :precondition (and
    (pointing ?d)
    (visible ?o ?d)
    (required-hd ?o)
    (not (stored-hd ?o))
    (not (stored-sd ?o))
    (not (sent ?o))
    (slot1-free)
    (not (hd-in-memory))
 )
 :effect (and
    (stored-hd ?o)
    (not (slot1-free))
    (hd-in-memory)
    (increase (total-cost) 2)
 )
)


; ==========================================================
; TAKE-PICTURE-HD — foto HD in slot 2 (costo 2)
;
; Usata solo se slot1 è già occupato (not slot1-free).
; Garantisce che slot2 venga riempito in ordine.
; ==========================================================
(:action take-picture-hd-s2
 :parameters (?o - object ?d - direction)
 :precondition (and
    (pointing ?d)
    (visible ?o ?d)
    (required-hd ?o)
    (not (stored-hd ?o))
    (not (stored-sd ?o))
    (not (sent ?o))
    (not (slot1-free))
    (slot2-free)
    (not (hd-in-memory))
 )
 :effect (and
    (stored-hd ?o)
    (not (slot2-free))
    (hd-in-memory)
    (increase (total-cost) 2)
 )
)


; ==========================================================
; TAKE-PICTURE-SD — foto SD in slot 1 (costo 2)
;
; SD occupa 3 unità: può coesistere con una foto HD (10+3=13).
; Non richiede (not hd-in-memory).
; ==========================================================
(:action take-picture-sd-s1
 :parameters (?o - object ?d - direction)
 :precondition (and
    (pointing ?d)
    (visible ?o ?d)
    (required-sd ?o)
    (not (stored-hd ?o))
    (not (stored-sd ?o))
    (not (sent ?o))
    (slot1-free)
 )
 :effect (and
    (stored-sd ?o)
    (not (slot1-free))
    (increase (total-cost) 2)
 )
)


; ==========================================================
; TAKE-PICTURE-SD — foto SD in slot 2 (costo 2)
; ==========================================================
(:action take-picture-sd-s2
 :parameters (?o - object ?d - direction)
 :precondition (and
    (pointing ?d)
    (visible ?o ?d)
    (required-sd ?o)
    (not (stored-hd ?o))
    (not (stored-sd ?o))
    (not (sent ?o))
    (not (slot1-free))
    (slot2-free)
 )
 :effect (and
    (stored-sd ?o)
    (not (slot2-free))
    (increase (total-cost) 2)
 )
)


; ==========================================================
; SEND-HD-S1 — trasmette foto HD da slot 1 (costo 2)
;
; Precondizioni:
;   - punta verso Nord (is-north ?n, non costante hardcoded)
;   - ?o è una foto HD in memoria
;   - slot1 occupato (questa foto è in slot1)
; Effetti:
;   - ?o risulta inviato, slot1 si libera
;   - hd-in-memory azzerato (nessuna HD più in memoria)
; ==========================================================
(:action send-hd-s1
 :parameters (?o - object ?n - direction)
 :precondition (and
    (pointing ?n)
    (is-north ?n)
    (stored-hd ?o)
    (not (slot1-free))
 )
 :effect (and
    (not (stored-hd ?o))
    (sent ?o)
    (slot1-free)
    (not (hd-in-memory))
    (increase (total-cost) 2)
 )
)


; ==========================================================
; SEND-HD-S2 — trasmette foto HD da slot 2 (costo 2)
; ==========================================================
(:action send-hd-s2
 :parameters (?o - object ?n - direction)
 :precondition (and
    (pointing ?n)
    (is-north ?n)
    (stored-hd ?o)
    (slot1-free)
    (not (slot2-free))
 )
 :effect (and
    (not (stored-hd ?o))
    (sent ?o)
    (slot2-free)
    (not (hd-in-memory))
    (increase (total-cost) 2)
 )
)


; ==========================================================
; SEND-SD-S1 — trasmette foto SD da slot 1 (costo 2)
;
; Non azzera hd-in-memory: una foto HD potrebbe ancora
; essere presente nell'altro slot.
; ==========================================================
(:action send-sd-s1
 :parameters (?o - object ?n - direction)
 :precondition (and
    (pointing ?n)
    (is-north ?n)
    (stored-sd ?o)
    (not (slot1-free))
 )
 :effect (and
    (not (stored-sd ?o))
    (sent ?o)
    (slot1-free)
    (increase (total-cost) 2)
 )
)


; ==========================================================
; SEND-SD-S2 — trasmette foto SD da slot 2 (costo 2)
; ==========================================================
(:action send-sd-s2
 :parameters (?o - object ?n - direction)
 :precondition (and
    (pointing ?n)
    (is-north ?n)
    (stored-sd ?o)
    (slot1-free)
    (not (slot2-free))
 )
 :effect (and
    (not (stored-sd ?o))
    (sent ?o)
    (slot2-free)
    (increase (total-cost) 2)
 )
)

)

; problem
; ==========================================================
; EASY PROBLEM
; ==========================================================
; Posizione iniziale : N
; Carica             : sufficiente (non modellata numericamente)
; Goal               : star1 HD inviata
;
; Oggetti: star1 (HD) visibile da E, noise1 non nel goal
;
; Piano atteso:
;   rotate-right n ne → rotate-right ne e
;   take-picture-hd-s1 star1 e
;   rotate-left e ne → rotate-left ne n
;   send-hd-s1 star1 n
;
; ==========================================================

(define (problem satellite-easy)

(:domain satellite)

(:objects
    n ne e se s sw w nw - direction
    star1 noise1 - object
)

(:init

    ; orientamento iniziale
    (pointing n)

    ; (is-north n): marcatore che indica qual è la direzione Nord.
    ; Serve perché nel domain 'n' è un oggetto, non una costante:
    ; non si può scrivere (pointing n) come precondizione nel domain.
    (is-north n)

    ; slot di memoria inizialmente liberi
    (slot1-free)
    (slot2-free)

    ; qualità richiesta
    (required-hd star1)

    ; visibilità degli oggetti per direzione
    (visible star1 e)
    (visible noise1 e)

    ; grafo di rotazione oraria (next-right)
    (next-right n  ne)
    (next-right ne e)
    (next-right e  se)
    (next-right se s)
    (next-right s  sw)
    (next-right sw w)
    (next-right w  nw)
    (next-right nw n)

    ; grafo di rotazione antioraria (next-left)
    (next-left ne n)
    (next-left e  ne)
    (next-left se e)
    (next-left s  se)
    (next-left sw s)
    (next-left w  sw)
    (next-left nw w)
    (next-left n  nw)

    ; costo iniziale azzerato
    (= (total-cost) 0)
)

(:goal
    (sent star1)
)

; minimizza il costo totale (energia spesa)
(:metric minimize (total-cost))

)

; plan
1. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   goals met: 0 of 1
2. (rotate-right ne e)
   deleted: (pointing ne)
   added: (pointing e)
   goals met: 0 of 1
3. (take-picture-hd-s1 star1 e)
   deleted: (slot1-free)
   added: (stored-hd star1) (hd-in-memory)
   goals met: 0 of 1
4. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   goals met: 0 of 1
5. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   goals met: 0 of 1
6. (send-hd-s1 star1 n)
   deleted: (stored-hd star1) (hd-in-memory)
   added: (sent star1) (slot1-free)
   goals met: 1 of 1
